# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'getantibody/tap'

# Utilities
brew 'direnv'
brew 'fish'
brew 'openssh'
brew 'zsh'

# Programming Languages
cask 'java8'
brew 'python'
brew 'r'
brew 'ruby'

# Programming Tools
brew 'antibody'
brew 'git'
brew 'gradle'
brew 'hub'
brew 'pipenv'
brew 'pyenv'

# Casks
cask 'dashlane'
cask 'db-browser-for-sqlite'
cask 'flux'
cask 'font-meslo-nerd-font'
cask 'google-chrome'
cask 'hyper'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'keepingyouawake'
cask 'rstudio'
cask 'slack'
cask 'sublime-text'
