# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'

# Utilities
brew 'fish'
brew 'openssh'
brew 'zsh'

# Programming Languages
cask 'java8'
brew 'python2'
brew 'python3'

# Programming Tools
brew 'git'
brew 'gradle'
brew 'hub'

# Casks
cask 'dashlane'
cask 'db-browser-for-sqlite'
cask 'flux'
cask 'google-chrome'
cask 'hyper'
cask 'iterm2'
cask 'keepingyouawake'
cask 'sublime-text'
