jhillyerd/plugin-git
dteoh/fish-homebrew-asdf
oh-my-fish/plugin-direnv
oh-my-fish/plugin-fasd
oh-my-fish/plugin-thefuck
kennethreitz/fish-pipenv
danhper/fish-ssh-agent
decors/fish-colored-man
laughedelic/pisces
decors/fish-ghq
oh-my-fish/plugin-jump
jethrokuan/fzf
oh-my-fish/plugin-gityaw
oh-my-fish/plugin-cd
