eamodio.gitlens
ms-python.python
mde.select-highlight-minimap
alefragnani.bookmarks
alefragnani.project-manager
aaron-bond.better-comments
coenraads.bracket-pair-colorizer-2
gruntfuggly.todo-tree
lamartire.git-indicators
skyapps.fish-vscode
streetsidesoftware.code-spell-checker
axosoft.gitkraken-glo
britesnow.vscode-toggle-quotes
wwm.better-align
formulahendry.code-runner
orepor.color-tabs-vscode-ext
oderwat.indent-rainbow
ryu1kn.partial-diff
tyriar.sort-lines
konstantin.wrapselection
davidanson.vscode-markdownlint
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
vscode-icons-team.vscode-icons
github.vscode-pull-request-github
ms-vscode.github-issues-prs
deerawan.vscode-dash
pkief.material-icon-theme
naumovs.color-highlight
anseki.vscode-color
bungcip.better-toml
mhutchie.git-graph
fabiospampinato.vscode-commands
fabiospampinato.vscode-todo-plus
exodiusstudios.comment-anchors
louiswt.regexp-preview
fabiospampinato.vscode-github-notifications-bell
richardwillis.vscode-gradle
editorconfig.editorconfig
quicktype.quicktype
akamud.vscode-theme-onedark
redhat.vscode-yaml
wayou.vscode-todo-highlight
visualstudioexptteam.vscodeintellicode
redhat.java
vscjava.vscode-java-dependency
naco-siren.gradle-language
vscjava.vscode-java-debug
vscjava.vscode-maven
james-yu.latex-workshop
vscjava.vscode-java-pack
vscjava.vscode-java-test
jetmartin.bats
imperez.smarty
gabrielbb.vscode-lombok
me-dutour-mathieu.vscode-github-actions
fabiospampinato.vscode-statusbar-debugger
fabiospampinato.vscode-open-in-github
