eamodio.gitlens
ms-python.python
mde.select-highlight-minimap
alefragnani.bookmarks
alefragnani.project-manager
aaron-bond.better-comments
coenraads.bracket-pair-colorizer-2
gruntfuggly.todo-tree
lamartire.git-indicators
skyapps.fish-vscode
streetsidesoftware.code-spell-checker
axosoft.gitkraken-glo
britesnow.vscode-toggle-quotes
wwm.better-align
formulahendry.code-runner
orepor.color-tabs-vscode-ext
oderwat.indent-rainbow
ryu1kn.partial-diff
tyriar.sort-lines
konstantin.wrapselection
davidanson.vscode-markdownlint
yzhang.markdown-all-in-one
akamud.vscode-theme-onedark
vscode-icons-team.vscode-icons
